fine_valve/rotor/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
		type            zeroGradient;
    }
    wall
    {
        type            zeroGradient;
    }
	AMI2
	{
		type			cyclicAMI;
		value			$internalField;
	}
	valve
	{
		type			zeroGradient;
	}
	AMI1
	{
		type			cyclicAMI;
		value			$internalField;
	}
}


// ************************************************************************* //
