fine_valve/rotor/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver          GAMG;
        tolerance       1e-2;
        relTol          0;
        smoother        DICGaussSeidel;
        cacheAgglomeration no;
        maxIter         50;
    }

    p
    {
        $pcorr;
        tolerance       1e-5;
        relTol          0.01;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          no;
    nOuterCorrectors    1000;
    nCorrectors         3;
    nNonOrthogonalCorrectors 1;
	pRefCell			0;
	pRefValue			0;
	residualControl
	{
		U
		{
			tolerance 1e-05;
			relTol		0;
		}
		p
		{
			tolerance 1e-04;
			relTol		0;
		}
	}		
}
/*
relaxationFactors
{
    "(U|k|epsilon).*"   1;
}*/

cache
{
    grad(U);
}
relaxationFactors
{
    fields
	{
		p	0.3;
		pFinal 0.8;		
	}
	equations
	{
		"U|k|epsilon" 0.3;
		"(U|k|epsilon)Final" 0.8;
	}
}
// ************************************************************************* //
