fine_valve/rotor/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

	//Get both sides of ami
	//---------------------
	
	//Get all faces in cellSet
	{
		name 	AMI;
		type	faceSet;
		action	new;
		source	patchToFace;
		sourceInfo
		{
			name AMI1;
		}
	}
	{
		name AMI;
		type faceSet;
		action add;
		source patchToFace;
		sourceInfo
		{
			name AMI2;
		}
	}
);